import { govUaImg, monGovImg } from "assets/media/document-icon";

interface RegulationDocument {
    text: string;
    img: string;
    link: string;
}

const regulationDocuments: RegulationDocument[] = [
    {
        text: "Закон України від 05.09.2017 № 2145-VIII \"Про освіту\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/2145-19"
    },
    {
        text: "Закон України від 01.07.2014 № 1556-VII \"Про вищу освіту\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/1556-18"
    },
    {
        text: "Закон України від 17.12.2021 № 1986-IX \"Про внесення змін до деяких законів України щодо військової освіти та науки\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/1986-20#top"
    },
    {
        text: "Постанова Кабінету Міністрів України від 30 грудня 2015 р. № 1187 \"Про затвердження Ліцензійних умов провадження освітньої діяльності\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/main/1187-2015-%D0%BF"
    },
    {
        text: "Наказ Міністерства освіти і науки України від 11.07.2019 року № 977 “Про затвердження Положення про акредитацію освітніх програм, за якими здійснюється підготовка здобувачів вищої освіти”;",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z0880-19#Text"
    },
    {
        text: "Наказ Міністерства освіти і науки України від 22.05.2020 року № 673 “Про затвердження Переліку спеціальностей, здобуття ступеня освіти з яких необхідне для доступу до професій, для яких запроваджено додаткове регулювання\";",
        img: monGovImg,
        link: "https://mon.gov.ua/ua/npa/pro-zatverdzhennya-pereliku-specialnostej-zdobuttya-stupenya-osviti-z-yakih-neobhidne-dlya-dostupu-do-profesij-dlya-yakih-zaprovadzheno-dodatkove-regulyuvannya"
    },
    {
        text: "Постанова Кабінету Міністрів України від 17.08.2002 № 1134 \"Про затвердження нормативів чисельності студентів (курсантів), аспірантів (ад'юнктів), докторантів, здобувачів наукового ступеня кандидата наук, слухачів, інтернів, клінічних ординаторів на одну штатну посаду науково-педагогічного працівника у вищих навчальних закладах III і IV рівня акредитації та вищих навчальних закладах післядипломної освіти державної форми власності\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/1134-2002-%D0%BF"
    },
    {
        text: "Наказ Міністерства оборони України від 09.01.2020 № 4 \"Про затвердження Положення про особливості організації освітньої діяльності у вищих військових навчальних закладах Міністерства оборони України та військових навчальних підрозділах закладів вищої освіти\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z0706-15"
    },
    {
        text: "Постанова Кабінету Мінсстрів України від 12.05.2021 № 467 \"Про затвердження Положення про вищі військові навчальні заклади\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/467-2021-%D0%BF#Text"
    },
    {
        text: "Наказ Міністерства оборони України, Міністерства освіти і науки України від 25.08.2021 № 251/926 \"Про затвердження Порядку заміщення на конкурсній основі вакантних посад науково-педагогічних працівників у вищих військових навчальних закладах, військових навчальних підрозділах закладів вищої освіти та керівників закладів фахової передвищої військової освіти, військових ліцеїв, що належать до сфери управління Міністерства оборони України\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z1461-16"
    },
    {
        text: "Наказ Міністерства оборони України від 05.06.2014 № 360 \"Про затвердження Інструкції про організацію та проведення військово-професійної орієнтації молоді та прийому до вищих військових навчальних закладів та військових навчальних підрозділів закладів вищої освіти\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z0704-14"
    },
    {
        text: "Наказ Міністерства оборони України від 12.01.2016 № 5 \"Про затвердження Інструкції про порядок організації і проведення військового (флотського) стажування, навчальної, виробничої, ремонтної, корабельної та інших видів практики курсантів (слухачів, студентів) вищих військових навчальних закладів, військових навчальних підрозділів вищих навчальних закладів\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/rada/show/z0191-16"
    },
    {
        text: "Лист Міністерства освіти і науки України від 15.08.2018 № 1/11-8681 \" Рекомендації щодо запобігання академічному плагіату та його виявлення в наукових роботах (авторефератах, дисертаціях, монографіях, наукових доповідях, статтях тощо)\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z0452-02"
    },
    {
        text: "Наказ Міністерства оборони України, Міністерства освіти і науки України від 08.05.2002 № 155/291 \"Про затвердження Інструкції з планування та обліку діяльності науково-педагогічних (педагогічних) працівників вищих військових навчальних закладів (військових навчальних підрозділів вищих навчальних закладів, навчальних центрів Збройних Сил України);",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z0452-02"
    },
    {
        text: "Наказ Міністерства оборони України, Міністерства освіти і науки України від 11.02.2016 №71/109 \"Про затвердження Положення про проведення атестації науково-педагогічних працівників вищих військових навчальних закладів, військових навчальних підрозділів вищих навчальних закладів, що належать до сфери управління Міністерства оборони України\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z0358-16"
    },
    {
        text: "Наказ Міністерства оборони України, Міністерства освіти і науки України від 14.12.2015 № 719/1289 \"Про затвердження Інструкції про організацію військової підготовки громадян України за програмою підготовки офіцерів запасу\";",
        img: govUaImg,
        link: "https://zakon.rada.gov.ua/laws/show/z1678-15"
    }
];

export { regulationDocuments };
